def area(a, h):
    '''
    Возвращает половину произведения двух чисел.
    :param a: первое десятичное число.
    :param h: второе десятичное число.
    :return: число, состоящее из произведения a и h, деленного на 2.
    '''
    return a * h / 2 

def perimeter(a, b, c):
    '''
    Возвращает сумму трёх чисел.
    :param a: первое десятичное число.
    :param b: второе десятичное число.
    :param c: третье десятичное число.
    :return: число, состоящее из суммы a, b и c.ы
    '''
    return a + b + c
